[
    {
        "id": 1,
        "title": "Travel Fanatix",
        "description": "Have you ever tried to plan your day in a foreign city and been unsure where to start? The Travel Fanatix daily travel planner allows you to create and organise a schedule of activities for your day. The travel planner will provide you with five recommended points of interest, along with the corresponding address, description and its rank on TripAdvisor. If the point of interest is something you want to see, add it to your planner with the press of a button!",
        "image": "./assets/images/projects/travel-fanatix-demo.gif",
        "linkDeployed": "https://agworkgit.github.io/travel-fanatix/",
        "linkRepo": "https://github.com/agworkgit/travel-fanatix"
    },
    {
        "id": 2,
        "title": "Professional Readme Generator",
        "description": "My motivation was to create an automated tool that can take user input and generate readme documentation files. I built this project because I am faced with having to create documentation for my projects every time I create something new and I needed a tool to streamline my workflow. The app solves the problem of having to research for the correct file structure and other nice to haves such as a table of contents and badges for the technologies used in the making of your project. I learned that node.js is a very powerful automation tool and that is essential to run server-side applications. What makes my project stand out is that it solves a real world problem that many developers face every time they finish a new project.",
        "image": "./assets/images/projects/readme-demo.gif",
        "linkDeployed": "https://github.com/agworkgit/readme-generator",
        "linkRepo": "https://github.com/agworkgit/readme-generator"
    },
    {
        "id": 3,
        "title": "Team Generator",
        "description": "My motivation was to create an automated tool that can take user input to generate an HTML file showcasing a team's details. I built this project so that I can quickly create a presentable HTML file with details about my team. The app solves the problem of having to think about how to structure a HTML and style it. I learned that node.js is a very powerful automation tool and that it's essential to run server-side applications. What makes my project stand out is that it gives you a quick and presentable HTML page with minimal effort.",
        "image": "./assets/images/projects/team-page-demo.png",
        "linkDeployed": "https://github.com/agworkgit/team-page-generator",
        "linkRepo": "https://github.com/agworkgit/team-page-generator"
    },
    {
        "id": 4,
        "title": "Geolocation Weather Forecast App",
        "description": "A weather forecast dashboard with geolocation from an API and persistant data. This is a graded assignment for module eight of edX's Skills Boot Camp in Front-End Web Development.",
        "image": "./assets/images/projects/geolocation-forecast-demo.gif",
        "linkDeployed": "https://agworkgit.github.io/geolocation-forecast-app/",
        "linkRepo": "https://github.com/agworkgit/geolocation-forecast-app"
    },
    {
        "id": 5,
        "title": "JavaScript Quiz Web App",
        "description": "A timed quiz web app so that the users can test their coding skills. This is a graded assignment for module six of edX's Skills Boot Camp in Front-End Web Development.",
        "image": "./assets/images/projects/quiz-demo.gif",
        "linkDeployed": "https://agworkgit.github.io/quiz-web-app/",
        "linkRepo": "https://github.com/agworkgit/quiz-web-app"
    },
    {
        "id": 6,
        "title": "Dragon Repeller - RPG Game",
        "description": "My motivation was to use my JavaScript skills to create a simple RPG game. I built this project so that I can practice my JavaScript skills and challenge myself. It's a very enjoyable gaming experience with a lot of interactivity from the users part and a lot of entertaining elements such as a custom theme song I created a while ago for a musical project I used to run called Pitchpilot, a custom video background and SFX for all interactive components of the game. I learned how to integrate sound, background music and video backgrounds to make an entertaining game. What makes my project stand out is that it uses a lot of entertaining elements users have come to expect out of a game.",
        "image": "./assets/images/projects/dragon-repeller-demo.png",
        "linkDeployed": "https://agworkgit.github.io/dragon-repeller-rpg/",
        "linkRepo": "https://github.com/agworkgit/dragon-repeller-rpg"
    }
]
